app/controllers/things_controller.rb

  def index
    @new_thing = Thing.new
    @things = nil
    if filter = params[:filter]
      @things = case filter
      when "mean"
        Thing.all(:order => 'current_votes DESC', :conditions => "category = 'mean'", :limit => 20)
---
SELECT * FROM `things` WHERE (category = 'mean') ORDER BY current_votes DESC LIMIT 50
SELECT * FROM `votes` WHERE (`votes`.thing_id = 100)

  def show
    @thing = Thing.find_by_id(params[:id])
---
SELECT * FROM `things` WHERE (`things`.`id` = '1') LIMIT 1

  def edit
    @thing = Thing.find(params[:id])
---
SELECT * FROM `things` WHERE (`things`.`id` = 1)

  def create
    thingy = params[:thing]
    thing_content = CGI.escapeHTML(thingy[:thing])

    @thing = Thing.new(:thing => CGI.escapeHTML(thing_content), :category => thingy[:category])

    @thing.ip = request.remote_ip

    respond_to do |format|
      if verify_recaptcha() && @thing.save
---
INSERT INTO `things` (`vote_for`, `category`, `created_at`, `disputed`, `updated_at`, `vote_against`, `thing`) VALUES(0, 'mean', '2009-07-10 05:28:57', 0, '2009-07-10 05:28:57', 0, 'This is really starting to hurt me.')

  def create_ajax
    @thing = Thing.new(:thing => CGI.escapeHTML(params[:body]), :category => params[:category])
    @thing.ip = request.remote_ip

    respond_to do |format|
      if @thing.save
---
INSERT INTO `things` (`category`, `updated_at`, `current_votes`, `thing`, `ip`, `created_at`) VALUES('mean', '2009-08-22 18:54:16', 0, 'eewffwefe', '127.0.0.1', '2009-08-22 18:54:16')

  def vote
    if request.post?
      @thing = Thing.find_by_id(params[:thing_id])
      if !@thing.nil?
        respond_to do |format|
          if Vote.add_new_vote(@thing, request.remote_ip, params[:direction])
            count = Thing.find_by_id(@thing.id).current_votes
---
SELECT * FROM `things` WHERE (`things`.`id` IS NULL) LIMIT 1
SELECT * FROM `votes` WHERE (user_id = '7' AND thing_id = 1) LIMIT 1